
#多元线性相关分析

#研究多个变量之间的关系
#例子：iris数据集，研究花瓣和花萼的长度、宽度之间的联系

x=iris[which(iris$Species=="setosa"),1:4]

plot(x)

#计算相关系数矩阵，cor()函数
cor(x)


#Swiss数据集（瑞士1888年各个州的生产力状况）
swiss

# Fertility 因变量
#.表示除了因变量之外的所有变量都放在右边
s=lm(Fertility ~ ., data=swiss)
print(s)

#模型汇总信息
summary(s)



test6.2 <- data.frame(
x1=c(0.4,0.4,3.1,0.6,4.7,1.7,9.4,10.1,11.6,12.6,10.9,23.1,23.1,21.6,23.1,1.9,26.8,29.9),
x2=c(52,23,19,34,24,65,44,31,29,58,37,46,50,44,56,36,58,51),
x3=c(158,163,37,157,59,123,46,117,173,112,111,114,134,73,168,143,202,124),
y=c(64,60,71,61,54,77,81,93,93,51,76,96,77,93,95,54,168,99))

lm.sol <- lm(y~1+x1+x2+x3, data=test6.2)
summary(lm.sol)
lm.new=lm(y~x1+x2+x3+I(x1^2)+I(x1*x2)+I(x1*x3)+I(x2^2)+I(x2*x3)+I(x3^2)+I(x1*x2*x3),data=test6.2)
summary(lm.new)
lm.temp=lm(y~x1+x2+I(x1^2)+I(x1*x2)+I(x1*x3)+I(x2*x3)+I(x3^2)+I(x1*x2*x3)+0,data=test6.2)
summary(lm.temp)


##########################
# 多元线性回归的核心价值问题：应该选择那些变量？

